export const DICE_COMMAND = '주사위';

export const DICE_NUMBER_RANGE = Object.freeze({
  min: 1,
  max: 100,
});

// 특정 숫자에 대한 코멘트를 key & value로 추가합니다.
export const DICE_COMMENT_DATA = Object.freeze({
  1: '무승부로 하지 않을래...? ',
  2: "Yesterday is history, Tomorrow is Mystery, Today is gift That's why we call it the present.",
  3: '주사위는 완전 잘못이 없습니다.',
  4: '독일에서는 4가 행운의 숫자래요...!',
  5: '모든 사람들을 모두 벌떡 일어나게끔 하는 숫자는??',
  9: '한 자리 숫자라니...',
  10: '오늘도 화이팅!',
  17: '17을 세제곱하여 나온 각 자리 숫자를 더하면 다시 17이 됩니다 😁',
  19: '이번주 미션은 19만 ',
  21: '블랙잭! ....이었다면 좋았을텐데.... ',
  22: '왜 봇이 두번 써지지...? 왜 봇이 두번 써지지...?',
  42: '삶, 우주, 그리고 모든 것!',
  50: '확률은 50%! ',
  52: '5252.. 자네의 주사위는.. ',
  53: '지듬도 안 늦었으니까 해봐! - 심슨',
  59: '항상 너를 응원해!! ',
  77: '운이 정말 좋으신데요? 로또라도 사러 가 보시는건 어떤가요?',
  88: '야 너도 할 수 있어',
  95: '자바가 처음 발표되었던 연도는 1995년 입니다.',
  99: '1%의 확률도 방심할 수 없습니다',
  100: '백! 엔드 하실래요?',
});
